In [1]:
import pandas as pd

In [5]:
df = pd.DataFrame({'Names': ["Emeka", "Chidera", "Emeka"], "Ages": [20, 22, 20], "ID": [1, 2, 1] })

In [6]:
df

     Names  Ages  ID
0    Emeka    20   1
1  Chidera    22   2
2    Emeka    20   1

In [7]:
# show the shape of the dataFrame before suplicates are removed

df.shape

(3, 3)

In [11]:
# remove the duplicates

df = df.drop_duplicates()

In [12]:
# show the shape of the df now without the duplicates

df.shape

(2, 3)

In [13]:
df

     Names  Ages  ID
0    Emeka    20   1
1  Chidera    22   2

In [ ]:
'''
So basically, a data frame is made up of individual series
'''